IDEA StatiCa Open Model
BentUpBar Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The BentUpBar type exposes the following members.
Properties
Name | Description
AddAnchor
 Add anchor to bent up bar
Angle
 Angle between bar and master edge
AnchorLength
 Length of anchor for bent up bar
BottomLength
 Length of additional bar on the bottom
Cover
 Cover of reinforcement
 (Inherited from ReinforcementGroup.)
CoverFromSetting
 Use cover from DetailModelSetting
 (Inherited from ReinforcementGroup.)
Diameter
 Diameter o reinforcement
 (Inherited from ReinforcementGroup.)
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
 (Inherited from ReinforcementGroup.)
EndsTypeBeg
 End type of the beginning of reinforcement bar
 (Inherited from ReinforcementGroup.)
EndsTypeEnd
 End type of the end of reinforcement bar
 (Inherited from ReinforcementGroup.)
Id
 Element Id
 (Inherited from OpenElementId.)
IsOnLeft
 Bar is on left or right side of member1D
MasterComponent
 Master component of reinforcement
Material
 Material
 (Inherited from Reinforcement.)
NumOfBarsInLayer
 Number of bars in layer
 (Inherited from ReinforcementGroup.)
Offset
 Offset of bent-Up bar from left/right edge
ReinfId
 Id representing reinforcement in Detail
 (Inherited from Reinforcement.)
TopLength
 Length of additional bar on the top
Top
See Also
Reference
BentUpBar Class
IdeaRS.OpenModel.Detail Namespace